// 自动生成的侧边栏配置
// 生成时间: 2026/3/1 21:55:55
// 扫描路径: D:\blog\src

export default {
  "/ai/": [
    "AI搭建"
  ],
  "/algorithm/": [
    "2022年算法队选拔赛",
    "2023年团体程序设计天梯赛",
    "Acwing基础课",
    "Leetcode热题100",
    "Leetcode第128场双周赛",
    "Leetcode第396场周赛",
    "Leetcode第398场周赛",
    "Leetcode随机打卡题",
    "数据结构与算法大作业",
    "牛客小白月赛81",
    "牛客小白月赛84",
    "牛客小白月赛85",
    "牛客小白月赛86",
    "牛客小白月赛87",
    "牛客小白月赛88",
    "牛客小白月赛91",
    "牛客小白月赛92",
    "第十三届蓝桥杯B组省赛",
    "第十二届蓝桥杯B组省赛",
    "第十四届蓝桥杯B组国赛",
    "第十四届蓝桥杯B组省赛"
  ],
  "/java/": [
    "BIO、NIO与Netty",
    "ElasticSearch入门",
    "IM多服务部署方案",
    "MyBatis缓存问题",
    "Netty部署问题梳理",
    "OA卡顿问题排查",
    "PGP加密",
    "SSO单点登录",
    "ThreadPoolExecutor源码解读",
    "Web视频处理方案",
    "人工客服方案",
    "内部通讯发送消息死锁问题",
    "单机版Redis分布式锁",
    "多租户多时区解决方案",
    "封装Java线程上下文的局部环境",
    "微信Native支付实现流程",
    "百万数据导入导出方案",
    "若依框架分页问题解决方案"
  ],
  "/linux/": [
    "Jenkins+Gitlab自动化部署",
    "Kubernetes",
    "Linux环境配置常用命令"
  ],
  "/mq/": [
    "RabbitMQ学习笔记"
  ],
  "/mysql/": [
    "MySQL实战45讲笔记"
  ],
  "/project/": [
    "MallChat项目笔记",
    "谷粒商城笔记",
    "项目灵感",
    "黑马点评项目笔记"
  ],
  "/python/": [
    "Python学习笔记"
  ],
  "/school/": [
    "C语言指针",
    "C语言错题集",
    "Java错题集",
    "人机交互复习资料",
    "操作系统原理错题集",
    "数据库系统原理错题集",
    "计算机组成原理错题集",
    "软件工程复习资料",
    "软件测试复习资料"
  ],
  "/tittle-tattle/": [
    "2024~2025年实习总结",
    "2025年实习第一阶段总结",
    "利尔化学工作总结",
    "自研产品",
    "菜鸟的第一次Java面试"
  ],
  "/tool/": [
    "百度网盘解析"
  ],
  "/vue/": [
    "Vue3集成Halo富文本编辑器"
  ]
};
